Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.IsFirst Method
 Determines whether an element is the first item of the collection.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsFirst(
	BinaryFilterExpressionItem BinaryFilterExpressionItem
)
Public Function IsFirst (
	BinaryFilterExpressionItem As BinaryFilterExpressionItem
) As Boolean
Parameters
BinaryFilterExpressionItem
Type: Tekla.Structures.Filtering.BinaryFilterExpressionItem
The element to evaluate. This value cannot be null.
Return Value
Type: Boolean
True if the element is the first item.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the supplied item is null.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace